app/controllers/rooms_controller.rb

  def index
    @rooms = Room.all
---
SELECT rooms.*, 6371.0 * 2 * ASIN(SQRT(POWER(SIN((-23.5611261 - rooms.latitude) * PI() / 180 / 2), 2) + COS(-23.5611261 * PI() / 180) * COS(rooms.latitude * PI() / 180) * POWER(SIN((-46.6892751 - rooms.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( SIN( (rooms.longitude - -46.6892751) / 57.2957795 ) * COS( (rooms.latitude) / 57.2957795 ), (COS( (-23.5611261) / 57.2957795 ) * SIN( (rooms.latitude) / 57.2957795)) - (SIN( (-23.5611261) / 57.2957795) * COS((rooms.latitude) / 57.2957795) * COS( (rooms.longitude - -46.6892751) / 57.2957795))) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM "rooms" WHERE "rooms"."type" = $1 AND (rooms.latitude BETWEEN -23.65105826059187 AND -23.471193939408128 AND rooms.longitude BETWEEN -46.78738639220921 AND -46.5911638077908 AND (6371.0 * 2 * ASIN(SQRT(POWER(SIN((-23.5611261 - rooms.latitude) * PI() / 180 / 2), 2) + COS(-23.5611261 * PI() / 180) * COS(rooms.latitude * PI() / 180) * POWER(SIN((-46.6892751 - rooms.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 10) ORDER BY distance ASC  [["type", "Psicologia"]]

  def show
    @room = Room.find(params[:id])
    @reviews = @room.reservations.map{ |r| r.reviews }.flatten
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."room_id" = $1  [["room_id", 10]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."reservation_id" = $1  [["reservation_id", 1]]

  def create
    @room = Room.new(room_params)
    @room.user = current_user
    if @room.save
---
INSERT INTO "rooms" ("address", "type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address", "cuiaba"], ["type", "dentista"], ["user_id", 1], ["created_at", "2017-11-14 18:59:31.459743"], ["updated_at", "2017-11-14 18:59:31.459743"]]

  def update
    if @room.update(room_params)
---
UPDATE "rooms" SET "description" = $1, "name" = $2, "price_centavos" = $3, "secretary" = $4, "psychology_couch" = $5, "cleaning" = $6, "smoking_allowed" = $7, "updated_at" = $8 WHERE "rooms"."id" = $9

  def destroy
    @room = Room.find(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]